brew "gcc"
brew "kopia"
brew "starship"
brew "tectonic"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
vscode "analytic-signal.preview-tiff"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bnavetta.zoterolatex"
vscode "cmillsdev.strudelvs"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "ekstasis.vscode-color-picker-hex"
vscode "executablebookproject.myst-highlight"
vscode "github.codespaces"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "h5web.vscode-h5web"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "kaih2o.python-resource-monitor"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mutantdino.resourcemonitor"
vscode "naumovs.color-highlight"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.vscode-yaml"
vscode "renan-r-santos.pixi-code"
vscode "snakemake.snakemake-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "witulski.selection-word-count"
flatpak "com.discordapp.Discord"
flatpak "md.obsidian.Obsidian"
flatpak "net.thunderbird.Thunderbird", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.fedoraproject.MediaWriter", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gimp.GIMP", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Calculator", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Calendar", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Characters", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Connections", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Contacts", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Extensions", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Logs", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Loupe", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Maps", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.NautilusPreviewer", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Papers", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Snapshot", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.TextEditor", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.Weather", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.baobab", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.clocks", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.font-viewer", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.jellyfin.JellyfinDesktop"
flatpak "org.videolan.vlc", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.zotero.Zotero"
